NasirZhou/-STM32-/User/RTOSPRO.c
#include "stm32f10x.h" //设备头文件
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "OLED.h"
#include "MyRTC.h"
#include "MPU6050.h"
#include "math.h"
#include "queue.h"
#include "semphr.h"
#include "usart.h"
#include "AD.h"
#include "TimerKey.h"
#include "TimerAlarm.h"
#include "Beep.h"
#include "max30102.h"
#include "gps.h"  
#include "delay.h"  
#include "usart2.h"
#include <string.h>
#include "wifi.h"
#define MAX_BRIGHTNESS 255
#define INTERRUPT_REG 0X00


#define M_PI (3.14159265358979323846264338327950288)

QueueHandle_t newsQueue_Handle;
QueueHandle_t StepQueue_Handle;

//以下内容是各个任务配置的定义列表,方便进行任务参数管理
//开始任务1
#define START_TASK_STACK_SIZE 64
#define START_TASK_PRIO 1
TaskHandle_t StartTask_Handle;
void StartTask(void *arg);

//手表桌面显示任务2
#define Watch_Home_STACK_SIZE 128
#define Watch_Home_PRIO 2
TaskHandle_t Watch_Home_Handle;
void Watch_Home(void *arg);

//抬腕检测任务3
#define Hand_Detect_STACK_SIZE 128
#define Hand_Detect_PRIO 1
TaskHandle_t Hand_Detect_Handle;
void Hand_Detect(void *arg);

//菜单任务4
#define Watch_Menu_STACK_SIZE 128
#define Watch_Menu_PRIO 2
TaskHandle_t Watch_Menu_Handle;
void Watch_Menu(void *arg);

//设置闹钟时间任务5
#define Watch_Alarm_STACK_SIZE 128
#define Watch_Alarm_PRIO 2
TaskHandle_t Watch_Alarm_Handle;
void Watch_Alarm(void *arg);

//设置闹钟角标任务6
#define Mini_Alarm_STACK_SIZE 32
#define Mini_Alarm_PRIO 1
TaskHandle_t Mini_Alarm_Handle;
void Mini_Alarm(void *arg);

//设置血氧检测任务7
#define Watch_Heart_STACK_SIZE 400
#define Watch_Heart_PRIO 2
TaskHandle_t Watch_Heart_Handle;
void Watch_Heart(void *arg);

//设置手表步数任务8
#define Watch_Step_STACK_SIZE 128
#define Watch_Step_PRIO 2
TaskHandle_t Watch_Step_Handle;
void Watch_Step(void *arg);

//设置GPS定位任务9
#define Watch_GPS_STACK_SIZE 512
#define Watch_GPS_PRIO 2
TaskHandle_t Watch_GPS_Handle;
void Watch_GPS(void *arg);

//设置手电筒任务10
#define Watch_Light_STACK_SIZE 32
#define Watch_Light_PRIO 2
TaskHandle_t Watch_Light_Handle;
void Watch_Light(void *arg);

//蜂鸣器发生11
#define BEEP_STACK_SIZE 32
#define BEEP_PRIO 1
TaskHandle_t BEEP_Handle;
void BEEP(void *arg);

//设置步数检测任务12
#define Step_detect_STACK_SIZE 128
#define Step_detect_PRIO 1
TaskHandle_t Step_detect_Handle;
void Step_detect(void *arg);

//设置串口2检测任务13
#define usart2_Detect_STACK_SIZE 256
#define usart2_Detect_PRIO 2
TaskHandle_t usart2_Detect_Handle;
void usart2_Detect(void *arg);

//设置显示数据任务14
#define Watch_News_STACK_SIZE 128
#define Watch_News_PRIO 2
TaskHandle_t Watch_News_Handle;
void Watch_News(void *arg);

//其他函数声明
void OLED_SHOW_TIME(void);
void OLED_SHOW_BAT(void);
void OLED_SHOW_TEMP(void);
void MUNE_FLAG(void);
void UpdateAttitude(int16_t AX, int16_t AY, int16_t AZ, int16_t GX, int16_t GY, int16_t GZ,float *pitch,float *roll);

void GPIO_Config_Init(void);
void RCC_Configuration(void);
void USART_Config_Init(void);
void USART_BaudRate_Init(uint32_t Data);
void NVIC_Configuration(void);

//中间层入口函数，用于创建开始任务，打开调度器
void RTOS_Process(void)
{
	xTaskCreate( 	StartTask,   			//任务函数
					"StartTask", 			//任务名字
					START_TASK_STACK_SIZE,	//任务堆栈大小
					NULL,					//任务函数参数
					START_TASK_PRIO,		//任务优先级
					&StartTask_Handle	);	//任务句柄
	
	vTaskStartScheduler();   //开始任务调度
}

//用开始任务创建其他任务.以及信号量
void StartTask(void *arg)
{
	taskENTER_CRITICAL();
	xTaskCreate(Watch_Home,"Watch_Home",Watch_Home_STACK_SIZE,NULL,Watch_Home_PRIO,&Watch_Home_Handle);
	xTaskCreate(Hand_Detect,"Hand_Detect",Hand_Detect_STACK_SIZE,NULL,Hand_Detect_PRIO,&Hand_Detect_Handle);
	xTaskCreate(Watch_Menu,"Watch_Menu",Watch_Menu_STACK_SIZE,NULL,Watch_Menu_PRIO,&Watch_Menu_Handle);
	xTaskCreate(Watch_Alarm,"Watch_Alarm",Watch_Alarm_STACK_SIZE,NULL,Watch_Alarm_PRIO,&Watch_Alarm_Handle);
	xTaskCreate(BEEP,"BEEP",BEEP_STACK_SIZE,NULL,BEEP_PRIO,&BEEP_Handle);
	xTaskCreate(Mini_Alarm,"Mini_Alarm",Mini_Alarm_STACK_SIZE,NULL,Mini_Alarm_PRIO,&Mini_Alarm_Handle);
	xTaskCreate(Watch_Heart,"Watch_Heart",Watch_Heart_STACK_SIZE,NULL,Watch_Heart_PRIO,&Watch_Heart_Handle);
	xTaskCreate(Watch_Light,"Watch_Light",Watch_Light_STACK_SIZE,NULL,Watch_Light_PRIO,&Watch_Light_Handle);
	xTaskCreate(Watch_GPS,"Watch_GPS",Watch_GPS_STACK_SIZE,NULL,Watch_GPS_PRIO,&Watch_GPS_Handle);
	xTaskCreate(Watch_Step,"Watch_Step",Watch_Step_STACK_SIZE,NULL,Watch_Step_PRIO,&Watch_Step_Handle);
	xTaskCreate(Step_detect,"Step_detect",Step_detect_STACK_SIZE,NULL,Step_detect_PRIO,&Step_detect_Handle);
	xTaskCreate(usart2_Detect,"usart2_Detect",usart2_Detect_STACK_SIZE,NULL,usart2_Detect_PRIO,&usart2_Detect_Handle);
	xTaskCreate(Watch_News,"Watch_News",Watch_News_STACK_SIZE,NULL,Watch_News_PRIO,&Watch_News_Handle);
	
	keyQueue_Handle = xQueueCreate(1,8);   //中断->任务之间传按键值
	alarmQueue_Handle = xQueueCreate(3,8);	//任务->中断之间传设定的时间
	StepQueue_Handle = xQueueCreate(1,16);	
	newsQueue_Handle = xQueueCreate(1,32);
	beepSemaphore = xSemaphoreCreateBinary();
	
	vTaskSuspend(Watch_News_Handle);
	vTaskSuspend(Watch_Step_Handle);
	vTaskSuspend(Watch_GPS_Handle);
	vTaskSuspend(Watch_Light_Handle);
	vTaskSuspend(Watch_Menu_Handle);
	vTaskSuspend(Watch_Alarm_Handle);
	vTaskSuspend(Mini_Alarm_Handle);
	vTaskSuspend(Watch_Heart_Handle);
	vTaskDelete(NULL);
    taskEXIT_CRITICAL();
	
}

void Watch_Home(void *arg)  //桌面显示任务的函数
{
	int key_event;
	while(1)
	{
		OLED_SHOW_TIME();
		OLED_SHOW_BAT();
		OLED_SHOW_TEMP();
		vTaskDelay(10);
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}
		if(key_event == 3)
		{
			OLED_Clear();
			key_event = 0;
			vTaskResume(Watch_Menu_Handle);
			vTaskSuspend(Hand_Detect_Handle);  //进入菜单记得挂起抬手检测
			vTaskSuspend(Watch_Home_Handle);
		}
	}
}

void Hand_Detect(void *arg)  //抬手检测的函数
{
	int16_t AX, AY, AZ, GX, GY, GZ;
	float pitch = 0.0; // 俯仰角
	float roll = 0.0;  // 横滚角
	BaseType_t taskSuspended_Flag = pdFALSE; // 用于记录任务是否已挂起 pdFALSE：恢复态 pdTRUE：挂起态
	
    while(1)
    {
		taskENTER_CRITICAL();  //为了保障iic的getdata，在此处进入临界区
		MPU6050_GetData(&AX, &AY, &AZ, &GX, &GY, &GZ);
        UpdateAttitude(AX, AY, AZ, GX, GY, GZ ,&pitch ,&roll);
		//printf("pitch:%f",pitch);
		taskEXIT_CRITICAL();  //退出临界区
		
