NasirZhou/-STM32-/User/RTOSPRO.c
		if(pitch>20 || pitch<-20)
		{
			if(taskSuspended_Flag == pdFALSE)  //该任务未挂起，则可以执行挂起
			{	
				taskENTER_CRITICAL();   //硬件ii2，在此处进入临界区
				OLED_Clear();
				OLED_Update(); //OLED驱动层写法规定
				taskEXIT_CRITICAL();
				vTaskSuspend(Watch_Home_Handle);
				taskSuspended_Flag = pdTRUE; //更改flag从而避免任务重复挂起
			}
		}
		
		else
		{
			if(taskSuspended_Flag == pdTRUE)  //该任务已挂起，则可以执行恢复
			{	
				vTaskResume(Watch_Home_Handle);
				taskSuspended_Flag = pdFALSE; //该任务已恢复的情况下，不能重复恢复
			}
		}
        vTaskDelay(10);
	} 
}

void OLED_SHOW_TIME(void)
{
	MyRTC_ReadTime();	//RTC读取时间，最新的时间存储到MyRTC_Time数组中
	OLED_ShowString(52, 16, "-   -", OLED_8X16); //日期分隔符
	OLED_ShowString(44, 32, ":   :", OLED_8X16); //时间分割符
	//OLED_ShowImage(96, 0, 32, 16, Signal);
	OLED_ShowNum(16, 16, MyRTC_Time[0], 4, OLED_8X16);
	OLED_ShowNum(64, 16, MyRTC_Time[1], 2,OLED_8X16);  //月份
	OLED_ShowNum(96, 16, MyRTC_Time[2], 2, OLED_8X16);
	OLED_ShowNum(24, 32, MyRTC_Time[3], 2, OLED_8X16); //小时
	OLED_ShowNum(56, 32, MyRTC_Time[4], 2,OLED_8X16);
	OLED_ShowNum(88, 32, MyRTC_Time[5], 2, OLED_8X16);
	OLED_Update();//更新
}

void OLED_SHOW_BAT(void)
{

	float Voltage;
	uint16_t bat_ad;
	bat_ad = AD_GetValue();
	Voltage = (float)bat_ad/4095*3.3;
	//printf("bat_ad:%d\r\n,Voltage:%f\r\n",bat_ad,Voltage);
	if(Voltage>3.0)
	{
		OLED_ShowImage(111,0,16,8,Battery_1);
	}
	else if(Voltage<3.0 && Voltage>2.0)
	{
		OLED_ShowImage(111,0,16,8,Battery_2);
	}
	else if(Voltage<2.0 && Voltage>1.0)
	{
		OLED_ShowImage(111,0,16,8,Battery_3);
	}
	else
	{
		OLED_ShowImage(111,0,16,8,Battery_4);
	}
	OLED_Update();//更新
	
}

void OLED_SHOW_TEMP(void)
{
	float TEMP;
	taskENTER_CRITICAL(); 
	TEMP =  MPU6050_GetTEMP();
	taskEXIT_CRITICAL(); 
	OLED_ShowNum(10,0,TEMP,2,OLED_6X8);
	OLED_ShowImage(24,0,8,8,Temp_Sign);
	OLED_Update();//更新
}

// 定义函数进行姿态检测
void UpdateAttitude(int16_t AX, int16_t AY, int16_t AZ, int16_t GX, int16_t GY, int16_t GZ ,float *pitch,float *roll) 
{
    // 加速度计的角度计算
    float accPitch = atan2(AY, sqrt(AX * AX + AZ * AZ)) * (180.0 / M_PI);
    float accRoll = atan2(-AX, AZ) * (180.0 / M_PI);
 
    // 陀螺仪积分得到角速度
    float gyroPitch = *pitch + (float)GY / 131.0; // 131 根据陀螺仪灵敏度调整
    float gyroRoll = *roll + (float)GX / 131.0;
 
    // 综合加速度计和陀螺仪数据，使用互补滤波
    float alpha = 0.98; // 互补滤波系数，根据需要调整
    *pitch = alpha * gyroPitch + (1.0 - alpha) * accPitch;
    *roll = alpha * gyroRoll + (1.0 - alpha) * accRoll;
}

void Watch_Menu(void *arg)
{
	int key_event;
	int MenuRoll;
	MenuRoll = 4;
	while(1)
	{
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}
		if( key_event == 1)
		{
			MenuRoll++;
			key_event = 0;
		}
		if( key_event == 2)
		{
			MenuRoll--;
			key_event = 0;
		}
		
		//越界判断
		if(MenuRoll>6)MenuRoll=1;
		if(MenuRoll<1)MenuRoll=6;
		if( key_event == 4)
		{
			key_event = 0;   //特别强调一下栈空间变量的初始化
			OLED_Clear();
			vTaskResume(Watch_Home_Handle);
			vTaskResume(Hand_Detect_Handle);
			vTaskSuspend(Watch_Menu_Handle);
			//由于任务已经挂起，Suspend之后的代码都执行不到
		}
		
		taskENTER_CRITICAL();
		switch(MenuRoll)
		{
			case 1:  MUNE_FLAG();	OLED_DrawCircle(39,60,3,1); OLED_ShowString(49,4,"Heart",OLED_6X8);   		OLED_ShowImage(49,20,30,30,Heart);       	 OLED_Update();	break;
			case 2:  MUNE_FLAG();	OLED_DrawCircle(49,60,3,1); OLED_ShowString(49,4,"Light",OLED_6X8);   		OLED_ShowImage(49,20,30,30,Light);       	 OLED_Update();	break;
			case 3:  MUNE_FLAG();	OLED_DrawCircle(59,60,3,1); OLED_ShowString(49,4,"Alarm",OLED_6X8);   		OLED_ShowImage(49,20,30,30,Alarm_Clock);	 OLED_Update();	break;
			case 4:	 MUNE_FLAG();	OLED_DrawCircle(69,60,3,1); OLED_ShowString(54,4,"Step",OLED_6X8); 			OLED_ShowImage(49,20,30,30,Step);			 OLED_Update();	break;
			case 5:  MUNE_FLAG();	OLED_DrawCircle(79,60,3,1); OLED_ShowString(54,4,"News",OLED_6X8);  		OLED_ShowImage(49,20,30,30,News);			 OLED_Update();	break;	
			case 6:  MUNE_FLAG();	OLED_DrawCircle(89,60,3,1); OLED_ShowString(54,4,"Gps",OLED_6X8);  	 		OLED_ShowImage(49,20,30,30,Gps);			 OLED_Update();	break;			
			default:break;
		}
		taskEXIT_CRITICAL();
		
		if( key_event == 3)
		{
			OLED_Clear();
			key_event =0;
			switch(MenuRoll)
			{
				case 1:  vTaskResume(Watch_Heart_Handle); vTaskSuspend(Watch_Menu_Handle); break;
				case 2:  vTaskResume(Watch_Light_Handle); vTaskSuspend(Watch_Menu_Handle);break;
				case 3:  vTaskResume(Watch_Alarm_Handle); vTaskSuspend(Watch_Menu_Handle); break;
				case 4:  vTaskResume(Watch_Step_Handle); vTaskSuspend(Watch_Menu_Handle); break;
				case 5:  vTaskResume(Watch_News_Handle); vTaskSuspend(Watch_Menu_Handle); break;
				case 6:  vTaskResume(Watch_GPS_Handle); vTaskSuspend(Watch_Menu_Handle);break;
				default:break;
			}
		}
			
		vTaskDelay(30);
	}
}


void MUNE_FLAG(void)

{
	/*显示进度点*/
//	OLED_Clear();
	OLED_ClearArea(30,0,68,64);
	OLED_DrawCircle(39,60,3,0);
	OLED_DrawCircle(49,60,3,0);
	OLED_DrawCircle(59,60,3,0);
	OLED_DrawCircle(69,60,3,0);
	OLED_DrawCircle(79,60,3,0);
	OLED_DrawCircle(89,60,3,0);
}

void Watch_Alarm(void *arg) //最主要的功能还是把设定的时间传出去（队列）
{
	int set_position =0;
	int key_event;
	int Alarm_time[3] = {12,0,0};
	int i;
	BaseType_t taskAlarm_Flag = pdFALSE;
	
	while(1)
	{	
		//按键检测
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}
		
		if( key_event == 3)
		{
			key_event =0;
			set_position++;
		}
		if (set_position>2)set_position=0; //位置变量的越界判断
		
		if( key_event == 1)
		{
			key_event =0;
			Alarm_time[set_position]+=1;
		}
		
		if( key_event == 2)
		{
			key_event =0;
			Alarm_time[set_position]-=1;
		}
		
		//设定时间的越界判断
		if(Alarm_time[0]>23)Alarm_time[0]=0;
		if(Alarm_time[0]<0)Alarm_time[0]=23;
		if(Alarm_time[1]>59)Alarm_time[1]=0;
		if(Alarm_time[1]<0)Alarm_time[1]=59;
		if(Alarm_time[2]>59)Alarm_time[2]=0;
		if(Alarm_time[2]<0)Alarm_time[2]=59;
		
		OLED_ShowString(0, 16, "Set Alarm", OLED_8X16); //时间分割符
		OLED_ShowString(44, 32, ":   :", OLED_8X16); //时间分割符
		OLED_ShowNum(24, 32, Alarm_time[0], 2, OLED_8X16); //小时
		OLED_ShowNum(56, 32, Alarm_time[1], 2,OLED_8X16);
		OLED_ShowNum(88, 32, Alarm_time[2], 2, OLED_8X16);
		OLED_ClearArea(23,48,82,16);
		OLED_ShowString(24 + set_position*32, 48, "--", OLED_8X16);
		OLED_Update();//更新
		
		if(key_event == 4)
		{
			OLED_Clear();
			key_event =0;
			if(taskAlarm_Flag == pdFALSE)
			{
			    //显示一个闹钟的小图标，告诉用户开启了闹钟功能
				vTaskResume(Mini_Alarm_Handle);
				TIM_ITConfig(TIM3,TIM_IT_Update,ENABLE);//打开中断，使得中断源能够进入中断服务程序
				taskAlarm_Flag = pdTRUE;
			}
			else
			{
				//擦除一个闹钟的小图标，告诉用户关闭了闹钟功能
				vTaskSuspend(Mini_Alarm_Handle);
				TIM_ITConfig(TIM3,TIM_IT_Update,DISABLE);//关闭中断，使得中断源不能够进入中断服务程序
				taskAlarm_Flag = pdFALSE;
			}
			for(i=0;i<3;i++)
			{
				xQueueSendToBack(alarmQueue_Handle,&Alarm_time[i],NULL);
			}
			vTaskResume(Watch_Menu_Handle);
			vTaskSuspend(Watch_Alarm_Handle);
		}
		vTaskDelay(20);
	}
}

void Mini_Alarm(void *arg)
{
	while(1)
	{
		taskENTER_CRITICAL();  				  	//在此处进入临界区
		OLED_ShowImage(2,50,10,10,Alarm_Clock_Min);
		OLED_Update(); 					    	//OLED驱动层写法规定
		taskEXIT_CRITICAL();
		vTaskDelay(20);
	}
}
	

void BEEP(void *arg)
{
	BaseType_t xFlag;
	while(1)
	{
		xFlag = xSemaphoreTake(beepSemaphore,0);
		if(xFlag==pdTRUE)
		{
			Beep_Commend(1);
			vTaskDelay(1500);
			Beep_Commend(0);
		}
		vTaskDelay(20);
	}	
}

void Watch_Light(void *arg) //最主要的功能还是把设定的时间传出去（队列）
{
	int key_event;
	int Light_Flag;
	while(1)
	{	
		//按键检测
		OLED_ShowString(0, 0, "Watch_Light:", OLED_8X16);
		if(Light_Flag == 1)
		{
			OLED_ClearArea(30,16,68,32);
			OLED_ShowString(64, 16, "OFF", OLED_8X16); 
		}
		else
		{
			OLED_ClearArea(30,16,68,32);
			OLED_ShowString(64, 16, "ON", OLED_8X16);
		}			
		OLED_Update();
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}
		
		if( key_event == 1)
		{
			key_event =0;
			GPIO_SetBits(GPIOA,GPIO_Pin_4);
			Light_Flag = 1; 
			OLED_Update(); 
		}
		
		if( key_event == 2)
		{
			key_event =0;
			GPIO_ResetBits(GPIOA,GPIO_Pin_4);
			Light_Flag = 0;
			OLED_Update(); 
		}

		if(key_event == 4)
		{
			OLED_Clear();
			key_event =0;
			vTaskResume(Watch_Menu_Handle);
			vTaskSuspend(Watch_Light_Handle);
		}
		vTaskDelay(20);
	}
}
void Watch_Heart(void *arg)  //桌面显示任务的函数
{
    int key_event;
    uint32_t aun_ir_buffer[100];        // 缓冲区大小缩减为100
    int32_t n_ir_buffer_length = 100;   // 缓冲区长度
    uint32_t aun_red_buffer[100];       // 缓冲区大小缩减为100
    int32_t n_sp02;                     // SpO2值
    int8_t ch_spo2_valid;               // SPO2有效性
    int32_t n_heart_rate;               // 心率值
    int8_t ch_hr_valid;                 // 心率有效性
    uint8_t Temp[6];                    // Temp改为数组，以接收6个字节
    uint32_t un_min = 0x3FFFF, un_max = 0;  
    int i;
    uint8_t dis_hr = 0, dis_spo2 = 0;

