NasirZhou/-STM32-/User/RTOSPRO.c
    // 初始化显示
    OLED_Clear();
    OLED_ShowString(0, 0, "Wait a moment...", OLED_8X16);
    OLED_Printf(0, 16, OLED_8X16, "心率:  BMP      ");
    OLED_Printf(0, 32, OLED_8X16, "血氧:  %%        ");
    OLED_Update();

    // 读取前100个样本
    for (i = 0; i < n_ir_buffer_length; i++) {
        while (MAX30102_INT == 1);   // 等待中断引脚断言
        max30102_FIFO_ReadBytes(REG_FIFO_DATA, Temp);  // 读取6个字节数据到Temp数组
        aun_red_buffer[i] =  (long)((long)((long)Temp[0] & 0x03) << 16) | (long)Temp[1] << 8 | (long)Temp[2];
        aun_ir_buffer[i] = (long)((long)((long)Temp[3] & 0x03) << 16) | (long)Temp[4] << 8 | (long)Temp[5];

        // 更新最大值和最小值
        if (un_min > aun_red_buffer[i]) un_min = aun_red_buffer[i];
        if (un_max < aun_red_buffer[i]) un_max = aun_red_buffer[i];
    }

    // 计算初步的心率和血氧
    maxim_heart_rate_and_oxygen_saturation(aun_ir_buffer, n_ir_buffer_length, aun_red_buffer, &n_sp02, &ch_spo2_valid, &n_heart_rate, &ch_hr_valid);

    // 循环读取数据并更新显示
    while (1) {
        // 更新缓存区并计算心率与血氧
        for (i = 0; i < n_ir_buffer_length - 1; i++) {
            aun_red_buffer[i] = aun_red_buffer[i + 1];    // 移动缓冲区
            aun_ir_buffer[i] = aun_ir_buffer[i + 1];      // 移动缓冲区

            // 更新最大值和最小值
            if (un_min > aun_red_buffer[i]) un_min = aun_red_buffer[i];
            if (un_max < aun_red_buffer[i]) un_max = aun_red_buffer[i];
        }

        // 添加新的样本
        while (MAX30102_INT == 1);  // 等待中断
        max30102_FIFO_ReadBytes(REG_FIFO_DATA, Temp);  // 读取传感器数据到Temp数组
        aun_red_buffer[n_ir_buffer_length - 1] =  (long)((long)((long)Temp[0] & 0x03) << 16) | (long)Temp[1] << 8 | (long)Temp[2];
        aun_ir_buffer[n_ir_buffer_length - 1] = (long)((long)((long)Temp[3] & 0x03) << 16) | (long)Temp[4] << 8 | (long)Temp[5];

        // 计算心率和血氧
        maxim_heart_rate_and_oxygen_saturation(aun_ir_buffer, n_ir_buffer_length, aun_red_buffer, &n_sp02, &ch_spo2_valid, &n_heart_rate, &ch_hr_valid);

        // 显示数据
        if (ch_hr_valid == 1 && n_heart_rate < 120) {
            dis_hr = n_heart_rate;
            dis_spo2 = n_sp02;
        } else {
            dis_hr = 0;
            dis_spo2 = 0;
        }

        // 更新OLED显示
        if (dis_hr == 0) {
            OLED_ShowString(0, 0, "Press                  ", OLED_8X16);
            OLED_Update();
        } else if (dis_spo2 <= 70) {
            OLED_Clear();
            OLED_ShowString(0, 0, "Press                  ", OLED_8X16);
            OLED_Printf(0, 16, OLED_8X16, "心率:%d BMP      ", dis_hr - 20);
            OLED_Printf(0, 32, OLED_8X16, "血氧:%d %%        ", dis_spo2 + 70);
            OLED_Update();
            printf("心率= %d BPM 血氧= %d\r\n", dis_hr, dis_spo2);
        } else {
            OLED_Clear();
            OLED_ShowString(0, 0, "Press                  ", OLED_8X16);
            OLED_Printf(0, 16, OLED_8X16, "心率:%d BMP      ", dis_hr - 20);
            OLED_Printf(0, 32, OLED_8X16, "血氧:%d %%        ", dis_spo2);
            OLED_Update();
            printf("心率= %d BPM 血氧= %d\r\n", dis_hr, dis_spo2);
        }

        // 处理按键事件
        if (keyQueue_Handle != NULL) {
            xQueueReceive(keyQueue_Handle, &key_event, 0);
        }
        if (key_event == 3) {
            OLED_Clear();
            key_event = 0;
        }
        if (key_event == 4) {
            OLED_Clear();
            key_event = 0;
            vTaskResume(Watch_Menu_Handle);
            vTaskSuspend(Watch_Heart_Handle);
        }

        // 延时
        vTaskDelay(20);
    }
}


void Watch_Step(void *arg) 
{
    int steps;
	int key_event;
    while (1) 
	{
		OLED_ShowString(32,0,"STEP:                  ",OLED_8X16);
		OLED_Update();
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}
		if (xQueueReceive(StepQueue_Handle ,&steps,0) == pdTRUE) 
		{
			// 这里应该是实际显示步数的代码，此处为打印
			OLED_ShowNum(40,16,steps,5,OLED_8X16);
			OLED_Update();
		}
		
		if(key_event == 4)
		{
			key_event = 0;
			vTaskResume(Watch_Menu_Handle);
			vTaskSuspend(Watch_Step_Handle);
		}
		vTaskDelay(20);
    }
}	


void Step_detect(void *arg)
{
	int16_t AX, AY, AZ, GX, GY, GZ;
	float pitch = 0.0; 
	float roll = 0.0; 
	int step_state;
	int steps;
	
    while(1)
    {
		taskENTER_CRITICAL();  
		MPU6050_GetData(&AX, &AY, &AZ, &GX, &GY, &GZ);
      UpdateAttitude(AX, AY, AZ, GX, GY, GZ ,&pitch ,&roll);
		taskEXIT_CRITICAL();  
		
		if(roll>30 || roll<-30)
		{
			step_state = 1;			
		}
		
		if(step_state == 1&&roll < 5&& roll >-10)  
		{	
			steps+=1;
			step_state = 0;
			xQueueOverwrite(StepQueue_Handle ,&steps);
		}		
        vTaskDelay(10);
	} 
}

void usart2_Detect(void *arg)
{
	char buf1[200];
	while(1)
	{
		if(USART1_RX_STA&0X8000) //检测sta的最高位是否为1（检测有没有收到一个数据包）
		{
			strncpy(buf1,(char*)USART1_RX_BUF+31,5);
//			printf("串口二收到:%s\r\n",buf1);
			xQueueOverwrite(newsQueue_Handle,&buf1);
			USART1_RX_STA = 0; //接收完信息之后清楚sta标志位，准备下一次接收
		}
	vTaskDelay(20);
	}
}

void Watch_News(void *arg)
{
	char mesg;
	int key_event;
	while(1)
	{
		if (xQueueReceive(newsQueue_Handle ,&mesg,0) == pdTRUE) 
		{
			//这里显示收到的信息
//			printf("%s\r\n",&mesg);
			OLED_ShowString(0,0,&mesg,OLED_8X16);
			OLED_Update();
			
		}
		if(keyQueue_Handle !=NULL)
		{
			xQueueReceive(keyQueue_Handle,&key_event,0);
		}		
		if(key_event == 4)
		{
			OLED_Clear();
			key_event = 0;
			vTaskResume(Watch_Menu_Handle);
			vTaskSuspend(Watch_Step_Handle);
		}
		vTaskDelay(20);
	}

}


//USART2管脚初始化
void GPIO_Config_Init(void)
{
 
	GPIO_InitTypeDef GPIO_InitStructure;
  /* Configure USART1 Rx as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  /* Configure USART1 Tx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

